$(document).ready(function(){
  // инициализация проектов
  var projects = [
    new ProjectCard(
      'images/exampleProjectPict.png',
      'Стартап',
      'Универсальный контроллер мониторинга технологических процессов',
      'Разработка контроллера (базы), который комплектуется необходимыми модулями для решения поставленных задач.',
      '72300',
      '2500',
      '0',
      '23д.'
    ),
    new ProjectCard(
      'images/vr.jpg',
      'Бизнес',
      'Виртуальные радости 2019: Зима близко',
      'Вестник игрового мира в оффлайне, журнал "Виртуальные радости" объявляет подписку до конца 2019 года',
      '1000 ',
      '3402',
      '0',
      '11ч.'
    ),
    new ProjectCard(
      'images/child.jpg',
      'Стартап',
      'Короткометражный фильм-антиутопия о правах ребенка',
      'Сбор средств на расходы во время съемки, а также на постпродакшен короткометражного игрового фильма-антиутопии о правах ребенка в духе "Черного зеркала".',
      '1200',
      '1201',
      '0',
      '1ч.'
    )
  ]

  // добавление проектов в разметку
  for (let i = 0; i < projects.length; i++) {
    projects[i].AddProjectCard('#popular-projects');
    projects[i].ShowProgressStatusPict();
  }
})